IDEA Open Model
LoadCaseType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Load case type
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum LoadCaseType
Public Enumeration LoadCaseType
Members
Member name | Value | Description
Permanent | 0 |  Permanent
Variable | 1 |  Variable
Accidental | 2 |  Accidental
Nonlinear | 5 |  Loadcase is for nonlinear analysis
See Also
Reference
IdeaRS.OpenModel.Loading Namespace